Another strange behaviour just noticed. When i trying to do some changes to test anything terraform tries to replaced the iam instance profile. It makes me think that it was created it before. But i can't see it on the AWS Console under role description. It's empty the arn part for instance profile. And always gives the error i mentioned above.
Terraform will perform the following actions:

  # aws_iam_instance_profile.my_profile is tainted, so must be replaced
-/+ resource "aws_iam_instance_profile" "my_profile" {
      ~ arn         = "arn:aws:iam::099705542861:instance-profile/my_profile" -> (known after apply)
      ~ create_date = "2021-01-20T11:30:34Z" -> (known after apply)
      ~ id          = "my_profile" -> (known after apply)
        name        = "my_profile"
      ~ unique_id   = "AIPARONXJ3DG4A3FQ5SRI" -> (known after apply)
        # (2 unchanged attributes hidden) 